# ExternalGeometryId Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ExternalGeometryId Members
ExternalGeometryId Class Constructors Methods Operators Properties See Also
---
The ExternalGeometryId type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ExternalGeometryId | Constructs an ExternalGeometryId object holding the given external geometry identifier. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Releases all resources used by the ExternalGeometryId |
| Equals | Determines whether the specified Object is equal to the current Object.  (Overrides Object..::..Equals(Object).) |
| GetHashCode | Gets the hash code.  (Overrides Object..::..GetHashCode()()()().) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| IsValidExternalGeometryId | Checks whether a given string represents a valid ExternalGeometryId or not. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Operators
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Equality | Determines whether two ExternalGeometryIds are the same. |
| Inequality | Determines whether two ExternalGeometryIds are different. |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Id | External geometry identifier. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
ExternalGeometryId Class
Autodesk.Revit.DB Namespace